dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/TIMG9_1.0.xml
        <register id="TIMG9_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="Z" description="Zero Event mask" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Disable Event"/>
                <bitenum id="SET" value="0x1" description="Enable Event"/>
            </bitfield>
            <bitfield id="L" description="Load Event mask" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="CCD0" description="Capture or Compare DN event mask CCP0" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="CCD1" description="Capture or Compare DN event mask CCP1" begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="CCU0" description="Capture or Compare UP event mask CCP0" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="CCU1" description="Capture or Compare UP event mask CCP1" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="TOV" description="Trigger Overflow Event mask" begin="25" end="25" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Disable Event"/>
                <bitenum id="SET" value="0x1" description="Enable Event"/>
            </bitfield>
            <bitfield id="DC" description="Direction Change Event mask" begin="27" end="27" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Disable Event"/>
                <bitenum id="SET" value="0x1" description="Enable Event"/>
            </bitfield>
            <bitfield id="QEIERR" description="QEIERR Event mask" begin="28" end="28" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Disable Event"/>
                <bitenum id="SET" value="0x1" description="Enable Event"/>
            </bitfield>
        </register>
        <register id="TIMG9_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="Z" description="Zero event generated an interrupt." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event Cleared"/>
                <bitenum id="SET" value="0x1" description="Event Set"/>
            </bitfield>
            <bitfield id="L" description="Load event generated an interrupt." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event Cleared"/>
                <bitenum id="SET" value="0x1" description="Event Set"/>
            </bitfield>
            <bitfield id="CCD0" description="Capture or compare down event generated an interrupt CCP0" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event Cleared"/>
                <bitenum id="SET" value="0x1" description="Event Set"/>
            </bitfield>
            <bitfield id="CCD1" description="Capture or compare down event generated an interrupt CCP1" begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event Cleared"/>
                <bitenum id="SET" value="0x1" description="Event Set"/>
            </bitfield>
            <bitfield id="CCU0" description="Capture or compare up event generated an interrupt CCP0" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event Cleared"/>
                <bitenum id="SET" value="0x1" description="Event Set"/>
            </bitfield>
            <bitfield id="CCU1" description="Capture or compare up event generated an interrupt CCP1" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event Cleared"/>
                <bitenum id="SET" value="0x1" description="Event Set"/>
            </bitfield>
            <bitfield id="TOV" description="Trigger overflow" begin="25" end="25" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event Cleared"/>
                <bitenum id="SET" value="0x1" description="Event Set"/>
            </bitfield>
            <bitfield id="DC" description="Direction Change" begin="27" end="27" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event Cleared"/>
                <bitenum id="SET" value="0x1" description="Event Set"/>
            </bitfield>
            <bitfield id="QEIERR" description="QEIERR, set on an incorrect state transition on the encoder interface." begin="28" end="28" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event Cleared"/>
                <bitenum id="SET" value="0x1" description="Event Set"/>
            </bitfield>
        </register>
        <register id="TIMG9_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="Z" description="Zero event generated an interrupt." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event Cleared"/>
                <bitenum id="SET" value="0x1" description="Event Set"/>
            </bitfield>
            <bitfield id="L" description="Load event generated an interrupt." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event Cleared"/>
                <bitenum id="SET" value="0x1" description="Event Set"/>
            </bitfield>
            <bitfield id="CCD0" description="Capture or compare down event generated an interrupt CCP0" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event Cleared"/>
                <bitenum id="SET" value="0x1" description="Event Set"/>
            </bitfield>
            <bitfield id="CCD1" description="Capture or compare down event generated an interrupt CCP1" begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event Cleared"/>
                <bitenum id="SET" value="0x1" description="Event Set"/>
            </bitfield>
            <bitfield id="CCU0" description="Capture or compare up event generated an interrupt CCP0" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event Cleared"/>
                <bitenum id="SET" value="0x1" description="Event Set"/>
            </bitfield>
            <bitfield id="CCU1" description="Capture or compare up event generated an interrupt CCP1" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event Cleared"/>
                <bitenum id="SET" value="0x1" description="Event Set"/>
            </bitfield>
            <bitfield id="TOV" description="Trigger overflow" begin="25" end="25" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event Cleared"/>
                <bitenum id="SET" value="0x1" description="Event Set"/>
            </bitfield>
            <bitfield id="DC" description="Direction Change" begin="27" end="27" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event Cleared"/>
                <bitenum id="SET" value="0x1" description="Event Set"/>
            </bitfield>
            <bitfield id="QEIERR" description="QEIERR" begin="28" end="28" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event Cleared"/>
                <bitenum id="SET" value="0x1" description="Event Set"/>
            </bitfield>
        </register>
